
/*****************************************************************************/
/*                                                                           */
/*                                 Константы                                 */
/*                                                                           */
/*****************************************************************************/

#ifndef DEFCONST_H
#define DEFCONST_H

//-----------------------------------------------------------------------------
// Константы общего назначения
#define PI        3.14159265358979323846 // Пи
#define GR_IN_RAD (180./PI)              // Число градусов в одном радиане
#define SEC_IN_RAD (GR_IN_RAD*3600)      // Число секунд в одном радиане
#define ROSQRT2   0.67448975             // Рo корней из 2
#define RO        0.4773                 // Po
#define DELTA_EQU 0.000001               // Минимальная разность для сравнения вещественных чисел

//#define EMPTY QString("")                // Пустая строка

//-----------------------------------------------------------------------------
// Предельные значения целых
#define MAX_LONG        2147483647
#define MIN_LONG       -2147483646
#define MAX_ULONG       4294967295
#define MAX_SHORT            32767
#define MIN_SHORT           -32766
#define MAX_USHORT           65535
#define MAX_CHAR               127
#define MIN_CHAR              -126
#define MAX_UCHAR              255

#endif // DEFCONST_H
